stress-down.yaml
# stress-down.yaml
config:
  target: "https://stage-apigw.shahrzaad.cloud"
  phases:
    - duration: 120        # 2 daqiqe
      arrivalRate: 1000     # har sāniye 200 request (200 RPS)
      name: "Overload Phase"
  defaults:
    headers:
      accept: "application/json, text/plain, */*"
      accept-language: "en-US,en;q=0.9"
      content-type: "application/json"
      origin: "https://stage-web.shahrzaad.cloud"
      platform: "pwa"
      referer: "https://stage-web.shahrzaad.cloud/"
      sec-fetch-dest: "empty"
      sec-fetch-mode: "cors"
      sec-fetch-site: "same-site"
      user-agent: "Mozilla/5.0 (iPhone; CPU iPhone OS 18_5 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.5 Mobile/15E148 Safari/604.1"

scenarios:
  - flow:
      - post:
          url: "/ApiContainer.CitizenProfile.Front.RCL1/api/v1/Account/individual/login-or-register"
          json:
            mobileNo: "09010000000"
            nonce: "16923519865158944797748068166486"